app/Controllers/BordirController.php

SELECT *
FROM `master_inisial`
WHERE `id_inisial` = 401
 LIMIT 1
---
        foreach ($dataProd as $row) {
            $kode_shipment = $row['kode_shipment'];
            $idInisial = $this->shipment->getIdInisial($kode_shipment);
            $dataInisial = $this->masterInisial->where('id_inisial', intval($idInisial['id_inisial']))->first();