app/Controllers/ExportController.php

        foreach ($dataProd as $row) {
            $kode_shipment = $row['kode_shipment'];
            $idInisial = $this->shipment->getIdInisial($kode_shipment);
            $dataInisial = $this->masterInisial->where('id_inisial', intval($idInisial['id_inisial']))->first();
---
SELECT *
FROM `master_inisial`
WHERE `id_inisial` = 105
 LIMIT 1