app/Controllers/MesinController.php

SELECT *
FROM `data`
---
    public function mesindata(): string
    {
        $data = [
            'Judul' => 'Data Mesin',
            'User' => session()->get('role')
        ];