app/Controllers/PackingController.php

                    ];
                    $existingInisial = $this->masterInisial->getWhere(['inisial' => $inisial])->getRow();
                    if (!$existingInisial) {
                        $this->masterInisial->insert($data2);
                    }
                    $dataInisial = $this->masterInisial->findAll();
---
INSERT INTO `master_inisial` (`no_model`, `style`, `inisial`, `po_inisial`, `colour`, `delivery`, `area`, `admin`, `created_at`, `updated_at`) VALUES ('BDE124', 'G41255-1 16.5X16', 'A1', 7, 'NATURAL WHITE NEW BLACK RW AY', '2023-12-21', 'KK1A', 'userpacking1', '2023-12-29 18:22:34', '2023-12-29 18:22:34')
SELECT *
FROM `master_inisial`

    public function mesin()
    {
        $dataProduksi = $this->prodModel->getAllData();
        foreach ($dataProduksi as $row) {

            $kode_shipment = $row['kode_shipment'];
            $idInisial = $this->shipment->getIdInisial($kode_shipment);
            $dataInisial = $this->masterInisial->where('id_inisial', intval($idInisial['id_inisial']))->first();
---
SELECT *
FROM `master_inisial`
WHERE `id_inisial` = 105
 LIMIT 1