app/Controllers/RekapController.php

    public function detailRekap($noModel)
    {
        $dataPdk = $this->dataPDK->where(['no_model' => $noModel])->first();
        $Disisial = $this->masterInisial->getMasterInisial($noModel);
        $dataInisial = $this->masterInisial->where('no_model', $noModel)->findAll();
---
SELECT *
FROM `master_inisial`
WHERE `no_model` = 'ER1012'

    public function export($noModel)
    {
        $dataPdk = $this->dataPDK->where(['no_model' => $noModel])->first();
        $Disisial = $this->masterInisial->getMasterInisial($noModel);
        $dataInisial = $this->masterInisial->where('no_model', $noModel)->findAll();
---
SELECT *
FROM `master_inisial`
WHERE `no_model` = 'SI2482'