app/Controllers/SettingController.php

SELECT *
FROM `master_inisial`
WHERE `id_inisial` = 1116
 LIMIT 1
---
    public function setting()
    {
        $dataProduksi = $this->prodModel->getSettingProduksi();

        $dataJoined = [];
        foreach ($dataProduksi as $row) {

            $kode_shipment = $row['kode_shipment'];
            $idInisial = $this->shipment->getIdInisial($kode_shipment);
            $dataInisial = $this->masterInisial->where('id_inisial', intval($idInisial['id_inisial']))->first();