app/Models/MasterProses.php

SELECT *
FROM `master_proses`
WHERE `nama_proses` = 'MC01A'
 LIMIT 1
---
    public function filterProses($filterThis)
    {
        $result = $this->where('nama_proses', $filterThis)->first();