app/Models/MasterInisial.php

    public function getDataByIdInisial($idInisial)
    {
        // Sesuaikan dengan struktur tabel dan kolom yang sesuai di database
        return $this->find($idInisial);
---
SELECT *
FROM `master_inisial`
WHERE `master_inisial`.`id_inisial` = '104'

    public function getAllData()
    {
        return $this->db->table('master_inisial')
            ->join('master_pdk', 'master_pdk.no_model = master_inisial.no_model')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `master_inisial`
JOIN `master_pdk` ON `master_pdk`.`no_model` = `master_inisial`.`no_model`

    public function getArea($noModel)
    {
        return $this->where('no_model', $noModel)->first();
---
SELECT *
FROM `master_inisial`
WHERE `no_model` = 'SI2482'

    public function getAllDataWithFlowProses()
    {
        return $this->db->table('master_inisial')
            ->join('flow_proses', 'flow_proses.id_inisial = master_inisial.id_inisial')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `master_inisial`
JOIN `flow_proses` ON `flow_proses`.`id_inisial` = `master_inisial`.`id_inisial`

    public function getIdInisial($validate)
    {
        $result = $this->where('no_model', $validate['no_model'])
            ->where('area', $validate['area'])
            ->where('style', $validate['jc'])
            ->first(); // Menggunakan first() untuk mendapatkan satu baris pertama
---
SELECT *
FROM `master_inisial`
WHERE `no_model` = 'SI2482'
AND `area` = 'KK2A'
AND `style` = 'J234022-2 15X11.5'
 LIMIT 1

    public function getMasterInisial($noModel)
    {
        $query = $this->select('area, sum(po_inisial) as po_inisial') // Menambahkan alias untuk hasil sum
            ->where('no_model', $noModel)
            ->first();
---
SELECT `area`, sum(po_inisial) as po_inisial
FROM `master_inisial`
WHERE `no_model` = 'SI2482'
 LIMIT 1

    public function getInisialsByNoModel($noModel)
    {
        return $this->where('no_model', $noModel)->findAll();
---
SELECT *
FROM `master_inisial`
WHERE `no_model` = 'BB2302'