app/Models/ProductionModel.php

SELECT *
FROM `production`
WHERE `id_proses` = '327'
AND `tgl_prod` = '2024-01-10'
AND `no_box` = 'G28756'
AND `storage_akhir` IS NULL
AND `qty_prod` = 72
AND `shift` = 'C'
---
    public function existingData($dataInsert)
    {
        $query = $this->where('id_proses', $dataInsert['id_proses'])
            ->where('tgl_prod', $dataInsert['tgl_prod'])
            ->where('no_box', $dataInsert['no_box'])
            ->where('storage_akhir', $dataInsert['storage_akhir'])
            ->where('qty_prod', $dataInsert['qty_prod'])
            ->where('shift', $dataInsert['shift'])->get();