app/Models/RekapModel.php

    public function sumStocklot($idProses)
    {
        $query = $this->selectSum('qty_prod', 'total_qty_prod')
            ->where('id_proses', $idProses)
            ->like('production.storage_akhir', 'STOCKLOT')
            ->get();
        $result = $query->getRow();
---
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '150'
AND  `production`.`storage_akhir` LIKE '%STOCKLOT%' ESCAPE '!'
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '296'
AND  `production`.`storage_akhir` LIKE '%STOCKLOT%' ESCAPE '!'

    public function sumGsin($idProses)
    {
        $query = $this->selectSum('qty_prod', 'total_qty_prod')
            ->where('id_proses', $idProses)
            ->like('production.storage_akhir', 'GS')
            ->get();
        $result = $query->getRow();
---
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '150'
AND  `production`.`storage_akhir` LIKE '%GS%' ESCAPE '!'
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '296'
AND  `production`.`storage_akhir` LIKE '%GS%' ESCAPE '!'

    public function sumGsOut($idProses)
    {
        $query = $this->selectSum('qty_prod', 'total_qty_prod')
            ->where('id_proses', $idProses)
            ->like('production.storage_awal', 'GS')
            ->get();
        $result = $query->getRow();
---
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '150'
AND  `production`.`storage_awal` LIKE '%GS%' ESCAPE '!'
SELECT SUM(`qty_prod`) AS `total_qty_prod`
FROM `production`
WHERE `id_proses` = '296'
AND  `production`.`storage_awal` LIKE '%GS%' ESCAPE '!'