app/Models/ShipmentModel.php

    public function getKodeShipment($id_inisial)
    {
        $kode_shipment = $this->where('id_inisial', $id_inisial)
            ->findAll();
---
SELECT *
FROM `shipment`
WHERE `id_inisial` = '401'
 LIMIT 1

    public function getIdInisial($kode_shipment)
    {
        $id_inisial = $this->where('kode_shipment', $kode_shipment)->first();
---
SELECT *
FROM `shipment`
WHERE `kode_shipment` = '58'
 LIMIT 1