app/Models/ShipmentModel.php

SELECT *
FROM `shipment`
WHERE `id_inisial` = '1120'
AND `delivery` = '2023-12-22'
 LIMIT 1
---
    public function getKodeShipment($validateShipment)
    {
        $kode_shipment = $this->where('id_inisial', $validateShipment['inisial'])
            ->where('delivery', $validateShipment['delivery'])
            ->first();