app/Models/Usermodels.php

SELECT *
FROM `users`
WHERE `username` = 'Ratna'
AND `password` = 'packing'
 LIMIT 1
---
    public function login($username, $password)
    {
        $user = $this->where(['username' => $username, 'password' => $password])->first();